'''
Дан файл с таблицей в формате TSV с информацией о росте школьников разных классов.

Напишите программу, которая прочитает этот файл и подсчитает для каждого класса средний рост учащегося.

Файл состоит из набора строк, каждая из которых представляет собой три поля:
Класс Фамилия Рост

Класс обозначается только числом. Буквенные модификаторы не используются. Номер класса может быть от 1 до 11 включительно.
В фамилии нет пробелов, а в качестве роста используется натуральное число,
но при подсчёте среднего требуется вычислить значение в виде вещественного числа.

Выводить информацию о среднем росте следует в порядке возрастания номера класса (для классов с первого по одиннадцатый).
Если про какой-то класс нет информации, необходимо вывести напротив него прочерк.

В качестве ответа прикрепите файл с полученными данными о среднем росте.


Sample Input:

6	Вяххи	159
11	Федотов	172
7	Бондарев	158
6	Чайкина	153

Sample Output:

1 -
2 -
3 -
4 -
5 -
6 156.0
7 158.0
8 -
9 -
10 -
11 172.0
'''

s = []
t = []
sm = 0
count = 0
s1 = []
r1 = []
nnn = ''

with open('../f5.txt', encoding='utf-8') as res:
    [s.append(i.split()) for i in res]
    [t.append(i[0]) for i in s]

    for i in range(1, 12):
        for j in s:
            if i == int(j[0]):
                count += 1
                sm += int(j[-1])
        s1.append(i)
        if sm == 0:
            r1.append('-')
        else:
            r1.append(sm / count)
        count, sm = 0, 0

    for k, v in zip(s1, r1):
        nnn += f'{k}\t{v}\n'


with open('../file_one.txt', 'w+', encoding='utf-8') as ouf:
    ouf.write(nnn)